[
    {
      "id": "001",
      "image": "https://i.ibb.co/qngPqBn/apple-iphone-13-01.jpg",
      "name": "iPhone 13",
      "type": "Smartphone",
      "price": "$799.00",
      "rating": 4.7,
      "brand": "Apple",
      "details": "The iPhone 13 is the latest flagship smartphone from Apple, designed to impress with its stunning features and exceptional performance. Powered by the powerful A15 Bionic chip, this device delivers blazing-fast speeds and seamless multitasking capabilities. Whether you're streaming HD videos, playing graphics-intensive games, or editing photos and videos, the iPhone 13 handles it all with ease.\n\nOne of the standout features of the iPhone 13 is its gorgeous Super Retina XDR display. With OLED technology and support for HDR content, the display offers vibrant colors, deep blacks, and incredible contrast for an immersive viewing experience. Whether you're browsing the web, watching movies, or scrolling through social media, every detail looks crisp and lifelike on the iPhone 13's display.\n\nIn addition to its powerful performance and stunning display, the iPhone 13 also boasts an advanced dual-camera system. The dual 12-megapixel rear cameras capture stunning photos and videos, even in low-light conditions, while the TrueDepth camera on the front allows for Face ID authentication and high-quality selfies.\n\nThe iPhone 13 also offers impressive battery life, allowing you to stay connected and productive throughout the day. And with support for 5G connectivity, you can experience faster download speeds and smoother streaming, whether you're at home or on the go.\n\nOverall, the iPhone 13 is a true powerhouse of a smartphone, offering a perfect blend of performance, design, and innovation. Whether you're a tech enthusiast, a professional, or just someone who appreciates quality craftsmanship, the iPhone 13 is sure to exceed your expectations."
    },
    {
      "id": "002",
      "image": "https://i.ibb.co/SnfDMpR/macbook-pro-14-m2-max.jpg",
      "name": "MacBook Pro 14",
      "type": "Laptop",
      "price": "$1499.00",
      "rating": 4.9,
      "brand": "Apple",
      "details": "The MacBook Pro is Apple's flagship laptop, designed for professionals and power users who demand the best performance and features. With its sleek design, powerful hardware, and stunning Retina display, the MacBook Pro sets the standard for premium laptops.\n\nAt the heart of the MacBook Pro is the groundbreaking M1 Pro chip, engineered by Apple to deliver unparalleled performance and efficiency. With up to 10-core CPU and 32-core GPU options, the M1 Pro chip delivers blazing-fast speeds and seamless multitasking, whether you're editing 4K videos, compiling code, or running professional applications.\n\nThe MacBook Pro features a stunning Liquid Retina XDR display, with True Tone technology and P3 wide color gamut for accurate colors and true-to-life images. Whether you're editing photos and videos or watching movies, the MacBook Pro's display delivers an immersive viewing experience with exceptional clarity and detail.\n\nIn addition to its powerful performance and stunning display, the MacBook Pro also offers advanced connectivity options, including Thunderbolt 4 ports for fast data transfer and charging. With Wi-Fi 6 and Bluetooth 5.0 support, you can stay connected to the internet and your devices with ease.\n\nThe MacBook Pro also features a redesigned keyboard with a scissor mechanism for a comfortable typing experience, as well as a large Force Touch trackpad for precise cursor control and gesture navigation.\n\nWith its premium design, powerful performance, and innovative features, the MacBook Pro is the ultimate laptop for professionals and power users who demand the best. Whether you're a creative professional, a developer, or a business user, the MacBook Pro empowers you to do more, wherever you go."
    },
    {
      "id": "003",
      "image": "https://i.ibb.co/Y2MvGy3/Bose-Quiet-Comfort-45-11-1920x1080-1.jpg",
      "name": "Bose QuietComfort 45",
      "type": "Headphones",
      "price": "$329.00",
      "rating": 4.8,
      "brand": "Bose",
      "details": "The Bose QuietComfort 45 headphones are the perfect companion for music lovers and frequent travelers alike, offering world-class noise cancellation and immersive sound quality in a sleek and comfortable design.\n\nFeaturing advanced noise-canceling technology, the QuietComfort 45 headphones block out unwanted distractions so you can focus on your music, podcasts, or calls without interference from the outside world. Whether you're on a noisy plane, train, or bus, the QuietComfort 45 headphones ensure a peaceful listening experience wherever you go.\n\nIn addition to their exceptional noise-canceling capabilities, the QuietComfort 45 headphones deliver rich, balanced sound with deep bass and crystal-clear highs. Whether you're listening to your favorite music genres, watching movies, or making phone calls, every sound comes through with stunning clarity and detail.\n\nDesigned for all-day comfort, the QuietComfort 45 headphones feature plush ear cushions and a lightweight design that allows you to wear them for extended periods without discomfort. The adjustable headband ensures a secure and personalized fit, while the rotating earcups fold flat for easy storage and transport.\n\nThe QuietComfort 45 headphones also offer convenient features for everyday use, including intuitive touch controls for adjusting volume, skipping tracks, and taking calls. With up to 24 hours of battery life on a single charge, you can enjoy uninterrupted listening throughout the day.\n\nWhether you're commuting, working, or relaxing at home, the Bose QuietComfort 45 headphones deliver unmatched comfort, noise cancellation, and sound quality, making them the perfect companion for any situation."
    },
    {
      "id": "004",
      "image": "https://i.ibb.co/tq34dSM/Samsung-QN90-A-8.jpg",
      "name": "Samsung QN90A",
      "type": "Television",
      "price": "$1999.99",
      "rating": 4.8,
      "brand": "Samsung",
      "details": "The Samsung QN90A Neo QLED 4K Smart TV is the pinnacle of home entertainment, combining cutting-edge technology, stunning design, and immersive features to deliver an unparalleled viewing experience.\n\nFeaturing Samsung's revolutionary Neo Quantum Processor, the QN90A delivers breathtaking picture quality with vibrant colors, deep blacks, and stunning contrast. With Quantum HDR 32X technology, this TV enhances every detail of your favorite movies, shows, and games, bringing them to life like never before.\n\nThe QN90A features an Infinity Screen design, with virtually bezel-less edges and a sleek, slim profile that enhances any living space. Whether you mount it on the wall or place it on a stand, the QN90A adds a touch of elegance to any room.\n\nOne of the standout features of the QN90A is its Object Tracking Sound technology, which delivers immersive 3D audio that follows the action on screen. With built-in speakers on all sides of the TV, you'll feel like you're right in the middle of the action, whether you're watching a blockbuster movie or playing a video game.\n\nThe QN90A is also a smart TV, powered by Samsung's Tizen operating system, which provides easy access to your favorite streaming services, apps, and content. With built-in voice assistants like Bixby, Alexa, and Google Assistant, you can control your TV and smart home devices with simple voice commands.\n\nOverall, the Samsung QN90A Neo QLED 4K Smart TV sets a new standard for home entertainment, with its stunning picture quality, immersive sound, and smart features. Whether you're a movie buff, a sports fan, or a gamer, the QN90A delivers an unrivaled viewing experience that will truly elevate your home entertainment setup."
    },
    {
      "id": "005",
      "image": "https://i.ibb.co/6YDnXc4/Play-Station-5-Gold-Edition.jpg",
      "name": "PlayStation 5",
      "type": "Console",
      "price": "$499.99",
      "rating": 4.9,
      "brand": "Sony",
      "details": "The PlayStation 5 is Sony's latest and most powerful gaming console, designed to deliver immersive gaming experiences with stunning graphics, lightning-fast load times, and innovative features.\n\nFeaturing a custom-designed AMD Ryzen Zen 2 CPU and RDNA 2 GPU, the PlayStation 5 delivers breathtaking graphics and smooth gameplay at up to 120 frames per second. Whether you're exploring vast open worlds, battling enemies in intense firefights, or racing against friends online, every game looks and feels incredible on the PlayStation 5.\n\nIn addition to its powerful hardware, the PlayStation 5 also introduces innovative features like haptic feedback and adaptive triggers, which provide immersive tactile sensations and enhanced gameplay experiences. Whether you're feeling the tension of drawing a bowstring or the recoil of firing a gun, the DualSense controller brings games to life in ways you've never experienced before.\n\nThe PlayStation 5 also boasts lightning-fast load times thanks to its custom SSD storage, which virtually eliminates loading screens and allows you to spend more time playing and less time waiting. With support for 3D audio and ray tracing, the PlayStation 5 delivers immersive soundscapes and realistic lighting effects that pull you deeper into your favorite games.\n\nWith its sleek design, powerful performance, and innovative features, the PlayStation 5 is the ultimate gaming console for players who demand the best. Whether you're a casual gamer, a competitive player, or a fan of immersive storytelling, the PlayStation 5 offers something for everyone, making it the centerpiece of your gaming setup."
    },
    {
      "id": "006",
      "image": "https://i.ibb.co/RCgCFm9/fall21-features-cover.jpg",
      "name": "Fitbit Versa 3",
      "type": "Wearable",
      "price": "$229.95",
      "rating": 4.6,
      "brand": "Fitbit",
      "details": "The Fitbit Versa 3 is a versatile smartwatch that helps you stay connected, motivated, and healthy with its advanced features and stylish design. Whether you're tracking your workouts, monitoring your sleep, or staying on top of your notifications, the Versa 3 has you covered.\n\nFeaturing built-in GPS, the Versa 3 accurately tracks your outdoor workouts like running, cycling, and hiking without the need for a smartphone. With real-time pace and distance tracking, you can see your progress in real-time and stay motivated to reach your fitness goals.\n\nThe Versa 3 also features heart rate monitoring, which tracks your heart rate 24/7 and provides insights into your overall heart health. Whether you're resting, exercising, or sleeping, the Versa 3 helps you understand how your heart responds to different activities and stressors.\n\nIn addition to its fitness tracking capabilities, the Versa 3 also offers advanced sleep tracking, which monitors your sleep stages and provides personalized insights to help you improve your sleep quality. With Sleep Score, you can see how well you slept each night and receive tips for better sleep habits.\n\nThe Versa 3 also keeps you connected to your favorite apps and notifications, allowing you to receive calls, texts, and app alerts right on your wrist. With built-in Amazon Alexa, you can use voice commands to set reminders, check the weather, and control your smart home devices with ease.\n\nWith its sleek design, long battery life, and advanced features, the Fitbit Versa 3 is the perfect companion for a healthy and active lifestyle. Whether you're a fitness enthusiast, a busy professional, or someone who simply wants to stay connected, the Versa 3 helps you live your best life, every day."
    },
    {
      "id": "007",
      "image": "https://i.ibb.co/QXLvNgb/linksys-velop-ax4200-wifi6-mesh-router-system-2.jpg",
      "name": "Linksys Velop AX4200",
      "type": "Networking",
      "price": "$299.99",
      "rating": 4.5,
      "brand": "Linksys",
      "details": "The Linksys Velop AX4200 is a high-performance mesh Wi-Fi system that provides fast, reliable internet coverage for your entire home. With its tri-band technology and advanced features, the Velop AX4200 ensures seamless connectivity and maximum throughput, even in large homes with multiple devices.\n\nFeaturing Wi-Fi 6 technology, the Velop AX4200 delivers blazing-fast speeds and low latency for smooth streaming, online gaming, and video conferencing. With support for up to 1200 Mbps on the 2.4 GHz band and 2400 Mbps on each of the two 5 GHz bands, the Velop AX4200 ensures that every device in your home gets the bandwidth it needs for optimal performance.\n\nThe Velop AX4200 is easy to set up and manage with the Linksys mobile app, which guides you through the installation process and allows you to monitor your network, prioritize devices, and perform speed tests from anywhere. With parental controls and guest access features, you can manage your network and keep your family safe online.\n\nIn addition to its advanced networking capabilities, the Velop AX4200 features a sleek, compact design that blends seamlessly into any home environment. Whether you place it on a shelf, countertop, or bookcase, the Velop AX4200 adds a touch of style to your home while providing powerful Wi-Fi coverage.\n\nWith its high-performance tri-band Wi-Fi, easy-to-use app, and sleek design, the Linksys Velop AX4200 is the ultimate mesh Wi-Fi system for modern homes. Whether you're streaming 4K movies, gaming online, or video conferencing with colleagues, the Velop AX4200 ensures that your home network is fast, reliable, and secure."
    },
    {
      "id": "008",
      "image": "https://i.ibb.co/Ltvj9F4/JBL-Flip-6-hero-brick.jpg",
      "name": "JBL Flip 6",
      "type": "Speaker",
      "price": "$129.95",
      "rating": 4.7,
      "brand": "JBL",
      "details": "The JBL Flip 6 is a portable Bluetooth speaker that delivers powerful sound and long-lasting battery life in a compact and rugged design. Whether you're at home, at the beach, or on a hiking trail, the Flip 6 lets you take your music wherever you go.\n\nFeaturing dual passive radiators and a racetrack-shaped driver, the Flip 6 delivers deep, punchy bass and crisp highs with room-filling sound. Whether you're listening to your favorite playlists, podcasts, or audiobooks, every sound comes through with stunning clarity and detail.\n\nWith its IP67 waterproof and dustproof rating, the Flip 6 is built to withstand the elements, making it perfect for outdoor adventures and poolside parties. Whether you're at the beach, by the pool, or on a boat, the Flip 6 can handle splashes, spills, and even submersion in water.\n\nThe Flip 6 also features a built-in rechargeable battery that provides up to 12 hours of continuous playback on a single charge. Whether you're listening to music all day at the beach or enjoying a night of camping under the stars, the Flip 6 keeps the party going without missing a beat.\n\nWith its rugged design, powerful sound, and long-lasting battery life, the JBL Flip 6 is the perfect companion for music lovers who are always on the go. Whether you're traveling, adventuring, or just relaxing at home, the Flip 6 lets you enjoy your favorite music wherever life takes you."
    },
    {
      "id": "009",
      "image": "https://i.ibb.co/swQBs7g/s-l1600.jpg",
      "name": "Canon EOS Rebel T7i",
      "type": "Camera",
      "price": "$749.00",
      "rating": 4.7,
      "brand": "Canon",
      "details": "The Canon EOS Rebel T7i is a versatile DSLR camera that combines advanced features and intuitive controls to help you capture stunning photos and videos with ease. Whether you're a beginner or an experienced photographer, the Rebel T7i offers the perfect combination of performance and simplicity.\n\nFeaturing a 24.2-megapixel APS-C CMOS sensor and DIGIC 7 image processor, the Rebel T7i delivers high-resolution images with stunning detail and clarity, even in low-light conditions. With a native ISO range of 100-25600, expandable to ISO 51200, you can capture sharp, noise-free photos and videos in any lighting situation.\n\nThe Rebel T7i features Canon's Dual Pixel CMOS AF system, which provides fast and accurate autofocus during both still photography and video recording. Whether you're shooting portraits, landscapes, or action scenes, the Rebel T7i ensures that your subjects are always in sharp focus.\n\nIn addition to its advanced imaging capabilities, the Rebel T7i offers a range of creative features and shooting modes to help you unleash your creativity. With built-in Wi-Fi, NFC, and Bluetooth connectivity, you can easily share your photos and videos with friends and family or control your camera remotely from your smartphone or tablet.\n\nWhether you're a photography enthusiast, a vlogger, or a content creator, the Canon EOS Rebel T7i is the perfect camera for capturing your creative vision. With its intuitive controls, versatile features, and stunning image quality, the Rebel T7i empowers you to take your photography to the next level."
    },
    {
      "id": "010",
      "image": "https://i.ibb.co/HrMNB0t/WD-My-Passport-SSD-DSC8743.jpg",
      "name": "Western Digital My Passport SSD",
      "type": "Storage",
      "price": "$149.99",
      "rating": 4.8,
      "brand": "Western Digital",
      "details": "The Western Digital My Passport SSD is a portable storage solution that offers blazing-fast transfer speeds, rugged durability, and ample storage capacity in a compact and stylish design. Whether you're backing up your files, transferring large media files, or storing your entire digital library, the My Passport SSD has you covered.\n\nFeaturing NVMe technology, the My Passport SSD delivers read speeds of up to 1050 MB/s and write speeds of up to 1000 MB/s, making it one of the fastest portable SSDs on the market. Whether you're editing high-resolution photos and videos or transferring large files, the My Passport SSD ensures smooth and efficient performance.\n\nThe My Passport SSD is built to withstand the rigors of everyday use, with a durable metal casing that protects your data from drops, shocks, and vibration. With its compact and pocket-sized design, the My Passport SSD is perfect for taking your files with you wherever you go, whether you're commuting, traveling, or working remotely.\n\nThe My Passport SSD is compatible with both Mac and PC, allowing you to use it with a wide range of devices without any additional software or drivers. With its USB 3.2 Gen-2 interface, the My Passport SSD offers universal compatibility and plug-and-play convenience, so you can start using it right out of the box.\n\nWhether you're a photographer, videographer, designer, or student, the Western Digital My Passport SSD is the perfect storage solution for your digital life. With its blazing-fast speeds, rugged durability, and compact design, the My Passport SSD empowers you to take your files with you wherever you go, so you can work and play without limits."
    },
    {
      "id": "011",
      "image": "https://i.ibb.co/pz7T4nk/productslider-black-panther-skin.jpg",
      "name": "Logitech MX Master 3",
      "type": "Peripheral",
      "price": "$99.99",
      "rating": 4.8,
      "brand": "Logitech",
      "details": "The Logitech MX Master 3 is an advanced wireless mouse that combines precision, comfort, and productivity-enhancing features to help you work smarter and faster. Whether you're a professional, a creative, or a power user, the MX Master 3 offers the perfect combination of performance and ergonomics.\n\nFeaturing Logitech's Darkfield 4000 DPI sensor, the MX Master 3 delivers precise tracking on virtually any surface, including glass and high-gloss surfaces. Whether you're working at your desk, in a coffee shop, or on the go, the MX Master 3 ensures smooth and accurate cursor control for maximum productivity.\n\nThe MX Master 3 features a unique ergonomic design that fits comfortably in your hand, with a sculpted shape and thumb rest that reduce wrist strain and fatigue during long hours of use. Whether you're scrolling through documents, navigating spreadsheets, or editing photos, the MX Master 3 provides a comfortable and natural grip for improved comfort and control.\n\nIn addition to its ergonomic design and precise tracking, the MX Master 3 offers customizable buttons and gestures that allow you to personalize your workflow and streamline your productivity. With programmable buttons, you can assign custom commands and shortcuts to specific tasks, while the gesture button allows you to perform actions like switching between apps and desktops with a swipe of your thumb.\n\nWhether you're a professional, a creative, or a power user, the Logitech MX Master 3 is the ultimate wireless mouse for maximizing productivity and comfort. With its advanced features, ergonomic design, and customizable controls, the MX Master 3 empowers you to work smarter and faster, so you can achieve more in less time."
    },
    {
      "id": "012",
      "image": "https://i.ibb.co/sWPj19w/oculusquest-blogroll-1600214092733-160w.jpg",
      "name": "Oculus Quest 2",
      "type": "Virtual Reality",
      "price": "$299.00",
      "rating": 4.8,
      "brand": "Meta",
      "details": "The Oculus Quest 2 is a cutting-edge virtual reality headset that offers immersive gaming, entertainment, and social experiences in a wireless and affordable package. Whether you're exploring virtual worlds, watching immersive 3D movies, or hanging out with friends in VR, the Quest 2 transports you to places you've only dreamed of.\n\nFeaturing a blazing-fast Qualcomm Snapdragon XR2 processor and 6GB of RAM, the Quest 2 delivers stunning graphics and smooth performance for even the most demanding VR experiences. Whether you're battling space pirates, exploring ancient ruins, or solving puzzles in virtual escape rooms, the Quest 2 offers immersive gameplay with no cables or external sensors to get in the way.\n\nThe Quest 2 features an advanced display with a resolution of 1832x1920 pixels per eye, offering crystal-clear visuals with vibrant colors and sharp details. Whether you're watching movies, playing games, or browsing the web, every scene comes to life with stunning realism and depth.\n\nIn addition to its powerful hardware and high-resolution display, the Quest 2 offers a wide range of VR experiences, including games, apps, and social experiences. With access to the Oculus Store, you can explore a vast library of content, from thrilling games and immersive experiences to educational apps and virtual travel destinations.\n\nWith its lightweight and comfortable design, the Quest 2 is easy to wear for extended periods, whether you're gaming, watching movies, or hanging out with friends in VR. With intuitive controls and built-in hand tracking, the Quest 2 offers a natural and immersive VR experience that's accessible to everyone.\n\nWhether you're a hardcore gamer, a casual user, or a VR enthusiast, the Oculus Quest 2 offers something for everyone, with its immersive experiences, powerful hardware, and affordable price tag. Whether you're exploring virtual worlds, socializing with friends, or discovering new experiences, the Quest 2 lets you experience VR like never before, making it the ultimate gateway to the metaverse."
    }
  ]